LinkJointForce
Syntax
SapObject.SapModel.Results.LinkJointForce
VB6 Procedure
Function LinkJointForce(ByVal Name As String, ByVal ItemTypeElm As eItemTypeElm, ByRef NumberResults As Long, ByRef Obj() As String, ByRef Elm() As String, ByRef PointElm() As String, ByRef LoadCase() As String, ByRef StepType() As String, ByRef StepNum() As Double, ByRef F1() As Double, ByRef F2() As Double, ByRef F3() As Double, ByRef M1() As Double, ByRef M2() As Double, ByRef M3() As Double) As Long
Parameters
Name
The name of an existing link object, link element or group of objects depending on the value of the ItemTypeElm item.
ItemTypeElm
This is one of the following items in the eItemTypeElm enumeration:
ObjectElm = 0
Element = 1
GroupElm = 2
SelectionElm = 3
If this item is ObjectElm, the result request is for the link element corresponding to the link object specified by the Name item.
If this item is Element, the result request is for the link element specified by the Name item.
If this item is GroupElm, the result request is for all link elements directly or indirectly specified in the group specified by the Name item.
If this item is SelectionElm, the result request is for link elements directly or indirectly selected and the Name item is ignored.
For GroupElm and SelectionElm a link element may be indirectly specified through point objects that have panel zone assignments and through line, area and solid objects that have spring assignments.
NumberResults
The total number of results returned by the program.
Obj
This is an array that includes the link object name associated with each result, if any.
Elm
This is an array that includes the link element name associated with each result.
PointElm
This is an array that includes the point element name associated with each result.
LoadCase
This is an array that includes the name of the analysis case or load combination associated with each result.
StepType
This is an array that includes the step type, if any, for each result.
StepNum
This is an array that includes the step number, if any, for each result.
F1, F2, F3
These are one dimensional arrays that include the joint force components in the point element local axes directions. [F]
M1, M2, M3
These are one dimensional arrays that include the joint moment components about the point element local axes. [FL]
Remarks
This function reports the joint forces for the point elements at the ends of the specified link elements.
The function returns zero if the forces are successfully recovered, otherwise it returns a nonzero value.
See Analysis Results Remarks for more information.
VBA Example
Similar to AreaJointForceShell
 'get link joint forces for link object "1"
 ret = SapModel.Results.LinkJointForce("1", ObjectElm, NumberResults, Obj, Elm, PointElm, LoadCase, StepType, StepNum, F1, F2, F3, M1, M2, M3)
Release Notes
Initial release in version 11.00.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
See Also
LinkForce
LinkDeformation